
//
//  MLNetwork+StatusCode.m
//  MLProject
//
//  Created by 妙龙赖 on 16/7/18.
//  Copyright © 2016年 妙龙赖. All rights reserved.
//

#import "MLNetwork+StatusCode.h"

@implementation MLNetwork (StatusCode)
+ (NSDictionary *)statusCodeDicionary
{
    return @{@"0":@"操作成功",
             @"10001":@"请求验证没有通过",
             @"10002":@"验证合法请求拦截器异常,详见日志",
             @"10003":@"未登录",
             @"10004":@"登录拦截器异常",
             @"300001":@"eip登录接口(信息部提供)发生异常,详见日志",
             @"300002":@"eip接口(信息部提供)提示非法用户",
             @"300003":@"eip接口(信息部提供)提示发生异常",
             @"300004":@"登录接口发生异常,详见日志",
             @"301001":@"未登录",
             @"301002":@"检测是否登录异常,详见日志",
             @"302001":@"用户设备绑定异常",
             @"303001":@"保存反馈意见异常",
             @"304001":@"获取app信息异常",
             @"305001":@"eip老师接口(信息部提供)发生异常",
             @"305002":@"获取老师信息接口发生异常,详见日志",
             @"306001":@"调用crm班级信息接口发生异常,详见日志",
             @"306002":@"调用crm班级信息接口没有获取到数据",
             @"306003":@"获取班级信息接口发生异常,详见日志",
             @"307001":@"调用crm获取学生接口发生异常",
             @"307002":@"调用crm接口没有获取到学生数据",
             @"307003":@"获取学生接口发生异常,详见日志",
             @"308001":@"点名发生异常",
             @"309001":@"暂无考勤数据",
             @"309002":@"获取学生考勤信息异常,详见日志",
             };
}
@end
